&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриходныеНакладныеМатериалы.Материал,
	|	ПриходныеНакладныеМатериалы.Ссылка.Дата,
	|	ПриходныеНакладныеМатериалы.Ссылка.Номер
	|ПОМЕСТИТЬ НакладнаяМатериалы
	|ИЗ
	|	Документ.ПриходныеНакладные.Материалы КАК ПриходныеНакладныеМатериалы
	|ГДЕ
	|	ПриходныеНакладныеМатериалы.Ссылка.Номер = &НомерНакладной";
	Запрос.УстановитьПараметр("НомерНакладной", "000000001");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст = "ВЫБРАТЬ
	| Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	| Номенклатура.Наименование КАК Наименование,
	| ЕСТЬNULL(НакладнаяМатериалы.Дата, 0) КАК Дата,
	| ЕСТЬNULL(НакладнаяМатериалы.Номер, 0) КАК Номер
	|ИЗ
	| Справочник.Номенклатура КАК Номенклатура
	| ЛЕВОЕ СОЕДИНЕНИЕ НакладнаяМатериалы КАК НакладнаяМатериалы
	| ПО Номенклатура.Ссылка = НакладнаяМатериалы.Материал
	|
	|УПОРЯДОЧИТЬ ПО
	| Номенклатура.Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	РезультатЗапроса = Запрос2.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	  Если Выборка.ЭтоГруппа Тогда
		Сообщить("Группа: " + Выборка.Наименование);
	  ИначеЕсли Выборка.Дата = 0 Тогда
	    Сообщить("Материал: " + Выборка.Наименование + " — поступлений нет");
	  Иначе
	    Сообщить("Материал: " + Выборка.Наименование + " Дата: " + Выборка.Дата + " Номер: " + Выборка.Номер);
	
	
	КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры


