Процедура ОбновлениеИндекса() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда

		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс( , Истина);
		
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура СлияниеИндексов() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда

 		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);

 		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

